# Celsius Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
UnitTypeId..::..Celsius Property
UnitTypeId Class See Also
---
Celsius.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public static ForgeTypeId Celsius { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property Celsius As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ Celsius {
	ForgeTypeId^ get ();
}
```

# See Also
UnitTypeId Class
Autodesk.Revit.DB Namespace